

const longDescriptionTransparent = `
    <h2>BARRIER RESTORING HYDRATING CREAM</h2>
    <p><b>Надзвичайно зволожуючий крем для обличчя</b> з високопроникною гіалуроновою кислотою, 
    антиоксидантним комплексом вітамінів А, С і Е, рослинними керамідами, і активними речовинами, 
    отриманими з центелли азіатської (мадекассозід і Т.Е.С.А.).</p>

    <p>Його поєднання зволожуючих, відновлюючих і антивікових інгредієнтів створює 
    <b>ідеальний крем для сухої шкіри</b>, спеціально розроблений для:</p>

    <ul>
        <li><b>Відновлення балансу гідроліпідної плівки</b>, що допомагає підтримувати оптимальний рівень зволоження.</li>
        <li><b>Ущільнення шкіри</b> для досягнення більш гладкого та молодого вигляду.</li>
        <li><b>Зменшення основних ознак старіння</b>, забезпечуючи її здоровий та сяючий вигляд.</li>
    </ul>
`

const longDescriptionBlue = `
    <h2>HAPCA FILLER</h2>
    <p><b>1% PrimalHyalTM Ultrafiller</b> з ефектом філера без ін'єкцій, що діє на ознаки старіння шкіри, та <b>2% суміш гіалуронової кислоти</b> з різними молекулярними масами для оптимального зволоження поверхневого шару шкіри, допомагаючи всмоктувати та утримувати вологу.</p>

    <p><b>Що саме робить цю формулу такою унікальною?</b></p>

    <ul>
        <li><b>Натрій РСА</b> (піролідонкарбонова кислота натрію) — частина природних факторів зволоження шкіри, що притягує та утримує воду в клітинах, підтримуючи її у зволоженому стані.</li>
        <li>Поєднання з гіалуроновою кислотою збільшує проникнення та утримання вологи, діючи як блокатор, який запобігає трансепідермальній втраті вологи (TEWL).</li>
        <li>Забезпечує збереження гіалуронової кислоти у глибоких шарах шкіри, уникаючи її втрати.</li>
    </ul>
`

const longDescriptionRed = `
    <h2>Azid</h2>
    <p><b>Інтенсивний комплексний догляд</b>, що поєднує азелаїнову кислоту з антивіковими та зволожуючими інгредієнтами:</p>

    <ul>
        <li><b>15% азелаїнової кислоти</b> — антибактеріальні, протизапальні та депігментуючі властивості.</li>
        <li>Зменшує плями, почервоніння та недоліки, контролюючи вироблення шкірного сала.</li>
        <li>Звужує пори та робить шкіру гладкішою та сяючою.</li>
    </ul>

    <p>Формула доповнена:</p>
    <ul>
        <li><b>1% карнозину</b> — антивіковий інгредієнт для синтезу колагену, зміцнення та захисту шкіри.</li>
        <li><b>1% колоїдної вівсянки</b> — заспокоює подразнення, знімає почервоніння та відновлює бар'єр шкіри.</li>
    </ul>

`
const longDescriptionOrange = `
    <h2>C-TETRA Е.F.</h2>
    <p><b>10% вітаміну C-Tetra</b>, що відзначається високою біологічною сумісністю та жиророзчинністю. Завдяки цьому вітамін C може проникати в найглибші шари шкіри.</p>

    <ul>
        <li>Дія зосереджена на меланоцитах для лікування недоліків зсередини.</li>
        <li>Стимулює синтез колагену, запобігаючи зморшкам і борючись із ними зсередини.</li>
    </ul>

    <p>Формула включає:</p>
    <ul>
        <li><b>Аскорбосилан</b> та <b>аскорбілглюкозид</b> — стабільні водорозчинні похідні вітаміну C, що покращують блиск шкіри та зменшують недоліки.</li>
        <li><b>Вітамін Е</b> та <b>ферулова кислота</b> — потужна антиоксидантна комбінація для захисту шкіри протягом усього дня.</li>
    </ul>
`

const longDescriptionDarkGreen = `
    <h2>CLINICAL VITAMIN A</h2>
    <p>Найдосконаліші та висококонцентровані сполуки вітаміну А: <b>Ретинол</b>, <b>Ретиналь</b> і <b>Гранактивний Ретиноїд</b> — для лікування та запобігання основним ознакам старіння шкіри.</p>

    <ul>
        <li><b>5% Гранактивний Ретиноїд</b>, 0,3% Ретинол та 0,1% Ретиналь</li>
        <li>Працює вночі, забезпечуючи максимальну ефективність проти старіння.</li>
    </ul>

    <p><b>Особливості:</b></p>
    <ul>
        <li>Використання сучасних форм вітаміну А для запобігання окисленню та втраті ефективності.</li>
        <li>Вдосконалена технологія інкапсуляції для правильного вивільнення в шкірі.</li>
    </ul>
`
const longDescriptionSalad = `
    <h2>SMOOTHING TREATMENT</h2>
    <p><b>Омолоджуючий засіб</b> із потужною сумішшю <b>20% неагресивних кислот</b>, <b>РНА</b> та <b>АНА</b>, у поєднанні із заспокійливим пептидним комплексом.</p>

    <p>Формула включає:</p>
    <ul>
        <li><b>Глюконолактон (РНА)</b> і <b>мигдальну кислоту (АНА)</b> — лагідно відлущують шкіру, видаляючи відмерлі клітини та сприяючи оновленню.</li>
        <li><b>5% пептидний комплекс</b> — зменшує подразнення та запалення, залишаючи шкіру у комфортному стані.</li>
    </ul>

    <p><b>Переваги:</b></p>
    <ul>
        <li>Оновлення шкіри без дискомфорту.</li>
        <li>Покращення сяйва, гладкості та молодості шкіри.</li>
    </ul>
`

const longDescriptionYellow = `
    <h2>Ви готові розкрити секрет сяючої та молодої шкіри?</h2>
    <p>Представляємо Вашій увазі <b>ЛІНО-8 (LİNO-8)</b>, наш антиоксидантний засіб з вітамінами. 
    Це насичена вітамінами сироватка, що містить у собі потужну антиоксидантну суміш вітамінів F, 
    К та коензиму Q10. Покращте свій щоденний догляд за шкірою та розкрийте її природне сяйво.</p>
    
    <p><b>Сироватка LINO-8</b> містить у собі потужне тріо активних інгредієнтів, які діють у 
    синергії, щоб забезпечити виняткові результати догляду за вашою шкірою:</p>
    
    <ul>
        <li><b>Вітамін Е</b> — незамінна жирна кислота з винятковими зволожуючими властивостями, яка допомагає підтримувати шкірний бар'єр, забезпечуючи тривале зволоження.</li>
        <li><b>Вітамін К</b> — підсилює еластичність шкіри та вирівнює її тон.</li>
        <li><b>Коензим Q10</b> — виконує роль потужного антиоксиданту, який сприяє виробленню колагену, зменшує появу дрібних ліній та зморшок, працює для підтримки більшої пружності та молодості вашої шкіри.</li>
    </ul>
    
    <p>Завдяки неймовірно легкій формулі, яка легко вбирається, сироватка LINO-8 бореться з 
    ознаками передчасного старіння, водночас підвищуючи рівень зволоження та роблячи колір 
    обличчя більш свіжим, додаючи вашій шкірі здорового та молодого вигляду.</p>
`
function showDialog(title) {
	// Знаходимо діалогове вікно
	const dialog = document.getElementById('productDialog')

    let content;

	switch (title) {
		case 'BARRIER RESTORING HYDRATING CREAM':
			content = `
            <h1>${title}</h1>
            <div>${longDescriptionTransparent}</div>
            `
			break
		case 'HAPCA FILLER':
			content = `
            <h1>${title}</h1>
            <div>${longDescriptionBlue}</div>
            `
			break
		case 'Azid':
			content = `
            <h1>${title}</h1>
            <div>${longDescriptionRed}</div>
            `
			break
		case 'C-TETRA Е.F.':
			content = `
            <h1>${title}</h1>
            <div>${longDescriptionOrange}</div>
            `
			break
		case 'CLINICAL VITAMIN A':
			content = `
            <h1>${title}</h1>
            <div>${longDescriptionDarkGreen}</div>
            `
			break
		case 'SMOOTHING TREATMENT':
			content = `
            <h1>${title}</h1>
            <div>${longDescriptionSalad}</div>
            `
			break
		case 'LINO-8':
			content = `
            <h1>${title}</h1>
            <div>${longDescriptionYellow}</div>
            `
			break
		default:
			content = '<p>Вибачте, опис продукту недоступний.</p>'
	}
	document.getElementById('dialogContent').innerHTML = content

	// Відкриваємо діалог
	dialog.showModal()
    dialog.scrollTop = 0
}
